In [1]:
from reframe import Relation

animal = Relation('/home/faculty/yasiro01/pub/animal.csv', sep=',')

In [5]:
%load_ext sql

In [6]:
%sql postgresql://yasiro01:@localhost/yasiro01

'Connected: yasiro01@yasiro01'

In [2]:
animal

   id                name  age               species   location
0   1               Chunk   34                Jaguar      Attic
1   2                Wind   99                  Newt   Basement
2   3  Underrated Thunder   74      Macaroni Penguin   Basement
3   4                 Axe   23        Long-Eared Owl     Garage
4   5        Wild Isotope   28      Humboldt Penguin      Attic
5   6          Night Star   26                  Newt     Garage
6   7        Random Bully   52             Armadillo  Back yard
7   8        Cunning Fury   38  Pink Fairy Armadillo  Back yard
8   9       Evening Chunk   50                  Newt   Basement
9  10             Thunder   38                Jaguar      Attic

In [15]:
animal.groupby(['location'])

In [ ]:
import pandas as pd
from sqlalchemy import create_engine

#conn = create_engine('postgresql://yasiro01@localhost/yasiro01')
#pd.read_csv('/home/faculty/yasiro01/pub/animal.csv', sep=',').to_sql('animal', conn)

In [7]:
%%sql

select *
from animal

10 rows affected.

[(0, 1, 'Chunk', 34, 'Jaguar', 'Attic'),
 (1, 2, 'Wind', 99, 'Newt', 'Basement'),
 (2, 3, 'Underrated Thunder', 74, 'Macaroni Penguin', 'Basement'),
 (3, 4, 'Axe', 23, 'Long-Eared Owl', 'Garage'),
 (4, 5, 'Wild Isotope', 28, 'Humboldt Penguin', 'Attic'),
 (5, 6, 'Night Star', 26, 'Newt', 'Garage'),
 (6, 7, 'Random Bully', 52, 'Armadillo', 'Back yard'),
 (7, 8, 'Cunning Fury', 38, 'Pink Fairy Armadillo', 'Back yard'),
 (8, 9, 'Evening Chunk', 50, 'Newt', 'Basement'),
 (9, 10, 'Thunder', 38, 'Jaguar', 'Attic')]

## Draw a table resulting from the following query:

```
animal.project([“species”])
```

In [3]:
animal.project(["species"])

                species
0                Jaguar
1                  Newt
2      Macaroni Penguin
3        Long-Eared Owl
4      Humboldt Penguin
6             Armadillo
7  Pink Fairy Armadillo

In [38]:
%%sql

select species
from animal

8 rows affected.

[('Jaguar',),
 ('Macaroni Penguin',),
 ('Long-Eared Owl',),
 ('Humboldt Penguin',),
 ('Armadillo',),
 ('Pink Fairy Armadillo',),
 ('Jaguar',),
 ('Aardvark',)]

In [37]:
%%sql

select species
from animal
group by species

7 rows affected.

[('Pink Fairy Armadillo',),
 ('Humboldt Penguin',),
 ('Long-Eared Owl',),
 ('Jaguar',),
 ('Macaroni Penguin',),
 ('Aardvark',),
 ('Armadillo',)]

In [53]:
animal.query('location == ').groupby(['location']).mean('age')

    location  mean_age
0  Back yard      52.0
1   Basement      86.5

In [56]:
%%sql

select avg(age)
from animal

1 rows affected.

[(Decimal('40.8750000000000000'),)]

## Draw a table resulting from the following query:
    
```
animal.query(“age > 70”).project([“name”, “location”])
```

In [16]:
animal.query("age > 170").project(["name", "location"])

Empty Relation
Columns: [name, location]
Index: []

## Draw a table resulting from the following query:

```
select name, age
from animal
where location = ‘Basement’
order by age desc;
```

In [8]:
%%sql

select name, age
from animal
where location = 'Basement'
order by age desc;

3 rows affected.

[('Wind', 99), ('Underrated Thunder', 74), ('Evening Chunk', 50)]

## Write a relational algebra query that displays number of animals by location.

In [10]:
animal.groupby(["location"]).count("name")

    location  count_name
0      Attic           3
1  Back yard           2
2   Basement           3
3     Garage           2

## Write a SQL query that displays average age of animals by species.

In [18]:
%%sql

select species, avg(age)
from animal
group by species;

8 rows affected.

[('Newt', Decimal('58.3333333333333333')),
 ('Pink Fairy Armadillo', Decimal('38.0000000000000000')),
 ('Humboldt Penguin', Decimal('28.0000000000000000')),
 ('Long-Eared Owl', Decimal('23.0000000000000000')),
 ('Jaguar', Decimal('36.0000000000000000')),
 ('Macaroni Penguin', Decimal('74.0000000000000000')),
 ('sloth', Decimal('73.3333333333333333')),
 ('Armadillo', Decimal('52.0000000000000000'))]

In [23]:
%%sql

select species, to_char(avg(age), '999,999.99')
from animal
group by species;

8 rows affected.

[('Newt', '      58.33'),
 ('Pink Fairy Armadillo', '      38.00'),
 ('Humboldt Penguin', '      28.00'),
 ('Long-Eared Owl', '      23.00'),
 ('Jaguar', '      36.00'),
 ('Macaroni Penguin', '      74.00'),
 ('sloth', '      73.33'),
 ('Armadillo', '      52.00')]

## Write a SQL query that displays all penguins in the zoo.

In [14]:
%%sql

select *
from animal
where species like '%Penguin%'

2 rows affected.

[(2, 3, 'Underrated Thunder', 74, 'Macaroni Penguin', 'Basement'),
 (4, 5, 'Wild Isotope', 28, 'Humboldt Penguin', 'Attic')]

## Write a SQL query to insert a new record into the animal table.

In [25]:
%%sql

insert into animal values(140, 140, 'Alice', 40, 'Aardvark', 'Attic')

1 rows affected.

[]

In [26]:
%%sql

select *
from animal

17 rows affected.

[(0, 1, 'Chunk', 34, 'Jaguar', 'Attic'),
 (1, 2, 'Wind', 99, 'Newt', 'Basement'),
 (2, 3, 'Underrated Thunder', 74, 'Macaroni Penguin', 'Basement'),
 (3, 4, 'Axe', 23, 'Long-Eared Owl', 'Garage'),
 (4, 5, 'Wild Isotope', 28, 'Humboldt Penguin', 'Attic'),
 (5, 6, 'Night Star', 26, 'Newt', 'Garage'),
 (6, 7, 'Random Bully', 52, 'Armadillo', 'Back yard'),
 (7, 8, 'Cunning Fury', 38, 'Pink Fairy Armadillo', 'Back yard'),
 (8, 9, 'Evening Chunk', 50, 'Newt', 'Basement'),
 (9, 10, 'Thunder', 38, 'Jaguar', 'Attic'),
 (11, 1, 'Tao', 100, 'sloth', 'graveyard'),
 (10, 1, 'Tao', 100, 'sloth', 'graveyard'),
 (10, 1, 'Tao', 100, 'sloth', 'graveyard'),
 (9, 1, 'Tao', 100, 'sloth', 'graveyard'),
 (10, 10, 'Tao', 20, 'sloth', 'grageyard'),
 (10, 11, 'Tao', 20, 'sloth', 'grageyard'),
 (140, 140, 'Alice', 40, 'Aardvark', 'Attic')]

## Write a SQL query to delete all newts from the animal table.

In [29]:
%%sql

delete
from animal
where species = 'sloth'

6 rows affected.

[]

In [31]:
%%sql

select *
from animal

8 rows affected.

[(0, 1, 'Chunk', 34, 'Jaguar', 'Attic'),
 (2, 3, 'Underrated Thunder', 74, 'Macaroni Penguin', 'Basement'),
 (3, 4, 'Axe', 23, 'Long-Eared Owl', 'Garage'),
 (4, 5, 'Wild Isotope', 28, 'Humboldt Penguin', 'Attic'),
 (6, 7, 'Random Bully', 52, 'Armadillo', 'Back yard'),
 (7, 8, 'Cunning Fury', 38, 'Pink Fairy Armadillo', 'Back yard'),
 (9, 10, 'Thunder', 38, 'Jaguar', 'Attic'),
 (140, 140, 'Alice', 40, 'Aardvark', 'Attic')]

In [32]:
%%sql

select *
from animal
where species like '%Penguin%'

2 rows affected.

[(2, 3, 'Underrated Thunder', 74, 'Macaroni Penguin', 'Basement'),
 (4, 5, 'Wild Isotope', 28, 'Humboldt Penguin', 'Attic')]

In [33]:
%%sql

select *
from animal
where species not like '%Penguin%'

6 rows affected.

[(0, 1, 'Chunk', 34, 'Jaguar', 'Attic'),
 (3, 4, 'Axe', 23, 'Long-Eared Owl', 'Garage'),
 (6, 7, 'Random Bully', 52, 'Armadillo', 'Back yard'),
 (7, 8, 'Cunning Fury', 38, 'Pink Fairy Armadillo', 'Back yard'),
 (9, 10, 'Thunder', 38, 'Jaguar', 'Attic'),
 (140, 140, 'Alice', 40, 'Aardvark', 'Attic')]